Задан `enum`, содержащий названия дней недели по порядку. Напишите программу, которая считает целое число N из потока ввода — номер дня недели — и выведет название дня недели по его номеру. Если задан некорректный номер дня недели (меньше 1 или больше 7), программа должна вывести `Нет такого дня недели`. В этой задаче удобно использовать конструкцию `switch`-`case` по `enum`.

```cpp
#include <iostream>

int main() {

    enum class Weekdays {

        Monday = 1,

        Tuesday,

        Wednesday,

        Thursday,

        Friday,

        Saturday,

        Sunday

    };

    int inp;

    std::cin >> inp;

    Weekdays day = static_cast<Weekdays>(inp);

    switch (day) {

        case Weekdays::Monday:

            std::cout << "Monday" << std::endl;

            break;

        case Weekdays::Tuesday:

            std::cout << "Tuesday" << std::endl;

            break;

        case Weekdays::Wednesday:

            std::cout << "Wednesday" << std::endl;

            break;

        case Weekdays::Thursday:

            std::cout << "Thursday" << std::endl;

            break;

        case Weekdays::Friday:

            std::cout << "Friday" << std::endl;

            break;

        case Weekdays::Saturday:

            std::cout << "Saturday" << std::endl;

            break;

        case Weekdays::Sunday:

            std::cout << "Sunday" << std::endl;

            break;

        default:

            std::cout << "Нет такого дня недели" << std::endl;

            break;

    }

}
```